// kram - Copyright 2020-2023 by Alec Miller. - MIT License
// The license and copyright notice shall be included
// in all copies or substantial portions of the Software.

#include "Kram.h"

#include <sys/stat.h>

//#include <atomic>
#include <inttypes.h>

#include <cmath>
#include <ctime>
//#include <algorithm>  // for max
//#include <string>
//#include <vector>

#include "KTXImage.h"
#include "KramDDSHelper.h"
#include "KramFileHelper.h"
#include "KramImage.h"  // has config defines, move them out
#include "KramMmapHelper.h"
#include "KramTimer.h"
#define KRAM_VERSION "1.0"
//#include "KramVersion.h"
#include "TaskSystem.h"
#include "lodepng.h"
#include "miniz.h"

#ifndef USE_LIBCOMPRESSION
#define USE_LIBCOMPRESSION 0 // (KRAM_MAC || KRAM_IOS)
#endif

#if USE_LIBCOMPRESSION
#include <compression.h>
#endif

// one .cpp must supply these new overrides
#if USE_EASTL
void* __cdecl operator new[](size_t size, const char* name, int flags, unsigned debugFlags, const char* file, int line)
{
    return new uint8_t[size];
}

void* operator new[](size_t size, size_t alignment, size_t alignmentOffset, const char* pName, int flags, unsigned debugFlags, const char* file, int line)
{
    return new uint8_t[size];  // TODO: honor alignment
}

#endif

//--------------------------------------

// name change on Win
#if KRAM_WIN
#define strtok_r strtok_s
#endif

namespace kram {

using namespace NAMESPACE_STL;

// This fails with libCompression (see inter-a.png)

    // This is returned by LoadPng.  Note that many png have this set
    // by default and not controllable by artists.
    bool isSrgb = false;
    
    Image singleImage;
    bool isLoaded = LoadPng(data, dataSize, false, false, isSrgb, singleImage);
    
    // don't need png data anymore
    close();

    if (!isLoaded) {
        return false;
    }

    // now move the png pixels into the KTXImage

    image.width = singleImage.width();
    image.height = singleImage.height();
    image.depth = 0;

    image.header.pixelWidth = image.width;
    image.header.pixelHeight = image.height;
    image.header.pixelDepth = image.depth;
    image.header.numberOfArrayElements = 0;
    image.header.numberOfMipmapLevels = 1;

    image.textureType = MyMTLTextureType2D;
    image.pixelFormat = isSrgb ? MyMTLPixelFormatRGBA8Unorm_sRGB : MyMTLPixelFormatRGBA8Unorm;

    // TODO: support mips with blitEncoder but that confuses mipCount in KTXImage
    //     Mipper can also generate on cpu side.  Mipped can do premul conversion though.

    // TODO: support chunks and striped png, but may need to copy horizontal to vertical

    // TODO: png has 16u format useful for heights

    image.initMipLevels(sizeof(KTXHeader));  // TODO: could also make this ktx2 with zstd compress
    image.reserveImageData();
    memcpy((uint8_t*)image.fileData, &image.header, sizeof(KTXHeader));

    memcpy((uint8_t*)image.fileData + image.mipLevels[0].offset, singleImage.pixels().data(), image.levelLength(0));

    return true;
}

bool KTXImageData::open(const uint8_t* data, size_t dataSize, KTXImage& image, bool isInfoOnly_)
{
    isInfoOnly = isInfoOnly_;
    close();

    if (isPNGFile(data, dataSize)) {
        // data stored in image
        return openPNG(data, dataSize, image);  // TODO: pass isInfoOnly
    }
    else if (isDDSFile(data, dataSize)) {
        // converts dds to ktx, data stored in image
        // Note: unlike png, this data may already be block encoded
        DDSHelper ddsHelper;
        return ddsHelper.load(data, dataSize, image, isInfoOnly);
    }

    // image will likely alias incoming data, so KTXImageData is unused

    if (!image.open(data, dataSize, isInfoOnly)) {
        return false;
    }
    return true;
}

// decoding reads a ktx file into KTXImage (not Image)
bool SetupSourceKTX(KTXImageData& srcImageData,
                    const string& srcFilename,
                    KTXImage& sourceImage,
                    bool isInfoOnly)
{
    if (!srcImageData.open(srcFilename.c_str(), sourceImage, isInfoOnly)) {
        KLOGE("Kram", "File input \"%s\" could not be opened for read.\n",
              srcFilename.c_str());
        return false;
    }
    return true;
}

// Twiddle pixels or blocks into Morton order.  Usually this is done during the upload of
// linear-order block textures.  But on some platforms may be able to directly use the block
// and pixel data if organized in the exact twiddle order the hw uses.
// Code adapted from KTX doc example.
class MortonOrder {
public:
    MortonOrder(uint32_t width, uint32_t height)
    {
        minDim = (width <= height) ? width : height;

        // Smaller size must be a power of 2
        assert((minDim & (minDim - 1)) == 0);

        // Larger size must be a multiple of the smaller
        assert(width % minDim == 0 && height % minDim == 0);
    }

    // For a given xy block in a mip level, find the block offset in morton order
    uint32_t mortonOffset(uint32_t x, uint32_t y)
    {
        uint32_t offset = 0, shift = 0;

        for (uint32_t mask = 1; mask < minDim; mask <<= 1) {
            offset |= (((y & mask) << 1) | (x & mask)) << shift;
            shift++;
        }

        // At least one of width and height will have run out of most-significant bits
        offset |= ((x | y) >> shift) << (shift * 2);
        return offset;
    }

private:
    uint32_t minDim = 0;
};

// rec709
// https://en.wikipedia.org/wiki/Grayscale
inline Color toGrayscaleRec709(Color c, const Mipper& mipper)
{
    const float4 kRec709Conversion = float4m(0.2126f, 0.7152f, 0.0722f, 0.0f);  // really a float3

    // convert to linear, do luminance, then back to srgb primary

    float4 clin = mipper.toLinear(c);
    float luminance = dot(clin, kRec709Conversion);
    luminance = std::min(luminance, 1.0f);  // to avoid assert if math goes above 1.0

    c.r = (uint8_t)(roundf(linearToSRGBFunc(luminance) * 255.0f));

    // can just copy into the other 3 terms
    c.g = c.b = c.r;
    return c;
}

bool LoadKtx(const uint8_t* data, size_t dataSize, Image& sourceImage)
{
    KTXImage image;

    // don't decompress pixel data, only going to unpack top level mip on KTX2
    // this stil aliases the incoming pixel data
    bool isInfoOnly = true;

    if (!image.open(data, dataSize, isInfoOnly)) {
        return false;
    }

    // this loads the top level into the sourceImage, caller must set chunkY to totalChunks
    return sourceImage.loadImageFromKTX(image);
}

// wrap miniz decompress, since it ignores crc checksum and is faster than default png
unsigned LodepngDecompressUsingMiniz(
    unsigned char** dstData, size_t* dstDataSize,
    const unsigned char* srcData, size_t srcDataSize,
    const LodePNGDecompressSettings* settings)
{
    // mz_ulong doesn't line up with size_t on Windows, but does on macOS
    KASSERT(*dstDataSize != 0);
    
#if USE_LIBCOMPRESSION
    // this returns 121 dstSize instead of 16448 on 126 srcSize.  
    // Open src dir to see this.  Have to advance by 2 to fix this.
    if (srcDataSize <= 2) {
        return MZ_DATA_ERROR;
    }
    
    char scratchBuffer[compression_decode_scratch_buffer_size(COMPRESSION_ZLIB)];
    size_t bytesDecoded = compression_decode_buffer(
         (uint8_t*)*dstData, *dstDataSize,
         (const uint8_t*)srcData + 2, srcDataSize - 2,
        scratchBuffer, // scratch-buffer that could speed up to pass
         COMPRESSION_ZLIB);
    
    int result = MZ_OK;
    if (bytesDecoded != *dstDataSize) {
        result = MZ_DATA_ERROR;
        *dstDataSize = 0;
    }
#else
    // This works.
    mz_ulong bytesDecoded = *dstDataSize;
    int result = mz_uncompress(*dstData, &bytesDecoded,
                               srcData, srcDataSize);
    
    if (result != MZ_OK || bytesDecoded != *dstDataSize) {
        *dstDataSize = 0;
    }
    else {
        *dstDataSize = bytesDecoded;
    }
#endif

    return result;
}

// wrap miniz compress
unsigned LodepngCompressUsingMiniz(
    unsigned char** dstData, size_t* dstDataSize,
    const unsigned char* srcData, size_t srcDataSize,
    const LodePNGCompressSettings* settings)
{
    // TODO: no setting for compression level in settings?
    // TODO: libCompression can only encode zlib to quality 5
    
    // mz_ulong doesn't line up with size_t on Windows, but does on macOS
    mz_ulong dstDataSizeUL = *dstDataSize;

    int result = mz_compress2(*dstData, &dstDataSizeUL,
                               srcData, srcDataSize, MZ_DEFAULT_COMPRESSION);

    *dstDataSize = dstDataSizeUL;
    
    return result;
}


//-----------------------

// TODO: fix this to identify srgb, otherwise will skip GAMA block
// no docs on how to identify srgb from iccp, ImageMagick might
// have code for this.˜
static const bool doParseIccProfile = false;

struct IccProfileTag
{
    uint32_t type, offset, size;
};

static void swapEndianUint32(uint32_t& x) {
    x =  ((x << 24) & 0xff000000 ) |
         ((x <<  8) & 0x00ff0000 ) |
         ((x >>  8) & 0x0000ff00 ) |
         ((x >> 24) & 0x000000ff );
}

// https://github.com/lvandeve/lodepng/blob/master/pngdetail.cpp
static int getICCInt32(const unsigned char* icc, size_t size, size_t pos) {
  if (pos + 4 > size) return 0;
    
  // this is just swapEndianUint32 in byte form
  return (int)((icc[pos] << 24) | (icc[pos + 1] << 16) | (icc[pos + 2] << 8) | (icc[pos + 3] << 0));
}

static float getICC15Fixed16(const unsigned char* icc, size_t size, size_t pos) {
  return getICCInt32(icc, size, pos) / 65536.0;
}

// this is all big-endian, so needs swapped, 132 bytes total
struct IccProfileHeader
{
    uint32_t size; // 0
    uint32_t cmmType; // 4 - 'appl'
    uint32_t version; // 8
    uint32_t deviceClass; // 12 - 'mntr'
    uint32_t inputSpace; // 16 - 'RGB '
    uint32_t outputSpace; // 20 - 'XYZ '
    uint16_t date[6]; // 24
    uint32_t signature; // 30 - 'ascp'
    uint32_t platform; // 32 - 'APPL'
    uint32_t flags; // 36
    uint32_t deviceManufacturer; // 40 - 'APPL'
    uint32_t deviceModel;
    uint32_t deviceAttributes[2]; // 48
    uint32_t renderingIntent; // 64
    uint32_t psx, psy, psz; // 68 - fixed-point float, illuminant
    uint32_t creator; // 80 - 'appl'
    uint32_t md5[4]; // 84
    uint32_t padding[7]; // 100
    uint32_t numTags; // 128
};
static_assert( sizeof(IccProfileHeader) == 132, "invalid IccProfileHeader");

#define MAKEFOURCC(str)                                                       \
    ((uint32_t)(uint8_t)(str[0]) | ((uint32_t)(uint8_t)(str[1]) << 8) |       \
    ((uint32_t)(uint8_t)(str[2]) << 16) | ((uint32_t)(uint8_t)(str[3]) << 24 ))


// this must be run after deflate if profile is compressed
bool parseIccProfile(const uint8_t* data, uint32_t dataSize, bool& isSrgb)
{
    isSrgb = false;
    
    // should look at other blocks if this is false
    if (dataSize < sizeof(IccProfileHeader)) {
        return false;
    }
    
    // copy header so can endianSwap it
    IccProfileHeader header = *(const IccProfileHeader*)data;
    // convert big to little endian
    swapEndianUint32(header.size);
    swapEndianUint32(header.numTags);
    
    if (header.signature != MAKEFOURCC("acsp")) {
        return false;
    }

    if (header.deviceModel == MAKEFOURCC("sRGB")) {
